consolidation-load-test-result
--------------------------------------
Metrics for period to: 19:39:10(-0300) (width: 0.496s)
--------------------------------------

http.codes.204: ................................................................ 38
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 57/sec
http.requests: ................................................................. 57
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 157
  mean: ........................................................................ 38.7
  median: ...................................................................... 3
  p95: ......................................................................... 135.7
  p99: ......................................................................... 153
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 157
  mean: ........................................................................ 38.7
  median: ...................................................................... 3
  p95: ......................................................................... 135.7
  p99: ......................................................................... 153
http.responses: ................................................................ 38
vusers.completed: .............................................................. 37
vusers.created: ................................................................ 58
vusers.created_by_name.0: ...................................................... 58
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.3
  max: ......................................................................... 159.6
  mean: ........................................................................ 42.6
  median: ...................................................................... 7.5
  p95: ......................................................................... 141.2
  p99: ......................................................................... 156


--------------------------------------
Metrics for period to: 19:39:20(-0300) (width: 1.719s)
--------------------------------------

http.codes.204: ................................................................ 462
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 443/sec
http.requests: ................................................................. 443
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 132
  mean: ........................................................................ 26.8
  median: ...................................................................... 13.9
  p95: ......................................................................... 79.1
  p99: ......................................................................... 102.5
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 132
  mean: ........................................................................ 26.8
  median: ...................................................................... 13.9
  p95: ......................................................................... 79.1
  p99: ......................................................................... 102.5
http.responses: ................................................................ 462
vusers.completed: .............................................................. 463
vusers.created: ................................................................ 442
vusers.created_by_name.0: ...................................................... 442
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.3
  max: ......................................................................... 135.1
  mean: ........................................................................ 31.3
  median: ...................................................................... 19.5
  p95: ......................................................................... 85.6
  p99: ......................................................................... 111.1


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 19:39:13(-0300)
--------------------------------

http.codes.204: ................................................................ 500
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 404/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 157
  mean: ........................................................................ 27.7
  median: ...................................................................... 13.1
  p95: ......................................................................... 85.6
  p99: ......................................................................... 133
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 157
  mean: ........................................................................ 27.7
  median: ...................................................................... 13.1
  p95: ......................................................................... 85.6
  p99: ......................................................................... 133
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.0: ...................................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4.3
  max: ......................................................................... 159.6
  mean: ........................................................................ 32.1
  median: ...................................................................... 19.1
  p95: ......................................................................... 90.9
  p99: ......................................................................... 135.7



------------------------------------------------------------------------------------------

--------------------------------------
Metrics for period to: 19:41:00(-0300) (width: 2.21s)
--------------------------------------

http.codes.200: ................................................................ 500
http.downloaded_bytes: ......................................................... 59500
http.request_rate: ............................................................. 500/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 10.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 10.1
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.0: ...................................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 31.5
  mean: ........................................................................ 6.4
  median: ...................................................................... 5.3
  p95: ......................................................................... 13.6
  p99: ......................................................................... 27.9


All VUs finished. Total time: 4 seconds

--------------------------------
Summary report @ 19:40:54(-0300)
--------------------------------

http.codes.200: ................................................................ 500
http.downloaded_bytes: ......................................................... 59500
http.request_rate: ............................................................. 500/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 10.1
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 3.1
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 10.1
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.0: ...................................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.3
  max: ......................................................................... 31.5
  mean: ........................................................................ 6.4
  median: ...................................................................... 5.3
  p95: ......................................................................... 13.6
  p99: ......................................................................... 27.9